{
  "name": "Hammas Masood,",
  "logo_name": "hammas-masood",
  "role": "A Front-end Developer",
  "about": {
    "sections": {
      "professional-info": {
        "title": "professional-info",
        "icon": "icons/info-professional.svg",
        "info": {
          "experience": {
            "title": "experience",
            "description": "<b>Nuxt.js Developer | Alnafi (October 2022 - Present):</b><br>Currently contributing as a Nuxt.js developer at Alnafi, where I actively participate in the development and enhancement of web applications. My role involves leveraging Vue.js with Nuxt.js to create dynamic and interactive user interfaces,Inetgrating API's and ensuring a seamless user experience. <br><br> <b> Nuxt.js Developer Intern | AL Nafi (July 2022 - October 2022):</b> <br> Initiated my journey in web development as an intern at AL Nafi. During this transformative period, I acquired foundational knowledge in Tailwind CSS, and Functional JavaScript, Vue.js and Nuxt.js laying the groundwork for my subsequent roles as a frontend developer.<br>"
          },
          "hard-skills": {
            "title": "hard-skills",
            "description": "<br>As a dedicated front-end developer, I bring a robust skill set to the table, proficient in crafting dynamic and responsive web applications. My foundation lies in HTML, CSS, and JavaScript, forming the backbone of my development capabilities. I have a solid understanding of Vue.js and its server-side renderer, Nuxt, enhancing my ability to build intuitive user interfaces. Additionally, I am actively expanding my expertise in React and Next.js, exploring their potential and honing my skills to contribute effectively in these frameworks. My toolkit also includes the efficient styling approach of Tailwind CSS, enabling me to streamline the design process and deliver modern, visually appealing web applications."
          },
          "soft-skills": {
            "title": "soft-skills",
            "description": "<br>Proficient in presentation and content writing, I excel at articulating complex ideas clearly. I thrive in group settings, fostering collaboration for shared goals. When working independently, I am self-motivated and deliver high-quality results. With strong leadership qualities, I guide others effectively. I'm a problem solver, using innovative strategies, and my typing speed of 60 WPM ensures efficient task handling. These skills underscore my adaptability and effectiveness in diverse professional scenarios."
          }
        }
      },
      "personal-info": {
        "title": "personal-info",
        "icon": "icons/info-personal.svg",
        "info": {
          "bio": {
            "title": "bio",
            "description": "<br> As a versatile Front-end Web Developer, I possess a solid foundation in front-end development principles, which allows me to adapt quickly and be a perfect fit for any application. My ability to grasp new concepts rapidly and my aptitude for problem-solving enable me to tackle various challenges and requirements effectively. With a strong focus on user experience and attention to detail, I can create seamless and responsive web solutions that cater to diverse audiences."
          },
          "interests": {
            "title": "interests",
            "description": "<br>I am constantly learning the latest tools and frameworks to stay at the forefront of technology. <br> In my free time, I engage in a dynamic array of hobbies that intertwine my passion for frontend development with a creative flair. While my professional journey excels in crafting seamless user interfaces and captivating user experiences, I find joy in blending these skills with artistic pursuits. As a seasoned gamer, I immerse myself in the captivating worlds of video games, appreciating the artistry and design behind interactive experiences. Additionally, my creative side flourishes through graphic design, where I leverage tools like Adobe Photoshop and Illustrator to experiment with visual concepts. These pursuits, whether honing my coding expertise, orchestrating delightful UI/UX experiences, or crafting digital art, serve as not just professional skills but as passions that drive my continuous growth and innovation."
          }
        }
      },
      "hobbies-info": {
        "title": "hobbies-info",
        "icon": "icons/info-hobbies.svg",
        "info": {
          "favorite-games": {
            "title": "games",
            "description": "<br>I am a passionate gamer"
          }
        }
      }
    }
  },
  "contacts": {
    "direct": {
      "title": "contacts",
      "sources": {
        "email": "hammasmasood@gmail.com",
        "phone": "+92 316 2411434"
      }
    },
    "social": {
      "github": {
        "title": "Github profile",
        "url": "https://github.com/",
        "user": "junaidsahar"
      },
      "facebook": {
        "title": "Facebook profile",
        "url": "https://www.facebook.com/",
        "user": "dangeriouxcrimnal.dkx"
      },
      "linkedin": {
        "title": "LinkedIn account",
        "url": "https://www.linkedin.com/in/",
        "user": "junaid-ahmed-sahar-8903b3224"
      }
    },
    "find_me_also_in": {
      "title": "find-me-also-in",
      "sources": {
        "dribble": {
          "title": "Dribble profile",
          "url": "https://dribbble.com/",
          "user": "Junaid-JK"
        },
        "behance": {
          "title": "Behance profile",
          "url": "https://www.behance.net/",
          "user": "imaadahmed4ce4"
        },
        "instagram": {
          "title": "Instagram account",
          "url": "https://www.instagram.com/",
          "user": "_junaid_ahmed_sahar/"
        }
      }
    }
  },
  "gists": {
    "1": "83861a67e377633ee8368df01ee3a355",
    "2": "694c1f32332788a2ac7f37b09e5aa40e"
  },
  "projects": {
    "1": {
      "title": "_alnafi.com",
      "description": "E learning platform new website using 3-Tier Architecture. Deployed on AWS with load balancing for autoscaling. Tailwind and Nuxt.js on the front end, with Django and MySql powering the backend Microservices Architecture, Vue3, Nuxt, Tailwindcss, Strapi, Django Python, Google Tag Manager, Sentry and Swipper",
      "img": "/images/projects/alnafi.png",
      "tech": ["Vue"],
      "url": "https://alnafi.com/"
    },
    "2": {
      "title": "_alnafi-cloud",
      "description": "Cloud Labs platform website using 3-Tier Architecture. Deployed on AWS with load balancing for autoscaling. Tailwind and Nuxt.js on the front end, with Django and MySql powering the backend Microservices Architecture, Vue3, Nuxt, Tailwindcss, Django Python and Sentry",
      "img": "/images/projects/alnafi.cloud.png",
      "tech": ["Vue"],
      "url": "https://alnafi.cloud/"
    },
    "3": {
      "title": "_alnafi-academy",
      "description": "O level academy website using 3-Tier Architecture. Deployed on AWS with load balancing for autoscaling. Tailwind and Nuxt.js on the front end, with Django and MySql powering the backend Microservices Architecture, Vue3, Nuxt, Tailwindcss, Strapi, Django Python, Google Tag Manager and Matoma Analytics",
      "img": "/images/projects/alnafi.academy.png",
      "tech": ["Vue"],
      "url": "https://alnafi.academy/"
    },
    "4": {
      "title": "_data-lake",
      "description": "Data lake for the for storing all applications products users payments data. Deployed on AWS with load balancing for autoscaling. Tailwind and Nuxt.js on the front end, with Django and MySql powering the backend Microservices Architecture, Vue3, Nuxt, Tailwindcss, Django Python, Apexchart",
      "img": "/images/projects/data-lake.png",
      "tech": ["Vue"],
      "url": "https://github.com/JunaidSahar/data-lake-admin-template"
    },
    "5": {
      "title": "_mind-smack",
      "description": "Real-time movie data from The Movie Database (TMDb), Stunning UI powered by Tailwind CSS, This project was a labor of love, combining the power of Vue.js/Nuxt.js for a fast and responsive frontend with TMDb's extensive movie data for a comprehensive catalog. Plus, the UI is a visual treat thanks to Tailwind CSS. <br>Check out GitHub repo here: <a target='_blank' href='https://github.com/JunaidSahar/mind-smack'>https://github.com/JunaidSahar/mind-smack</a></br>",
      "img": "/images/projects/mind-smack.png",
      "tech": ["Vue"],
      "url": "https://mindsmack.netlify.app/"
    },
    "6": {
      "title": "_alnafi-epay",
      "description": "EPAY website using 3-Tier Architecture. Deployed on AWS with load balancing for autoscaling. Tailwind and Nuxt.js on the front end, with Django and MySql powering the backend Microservices Architecture, Vue3, Nuxt, Tailwindcss, Django Python, Google Tag Manager and Matoma Analytics",
      "img": "/images/projects/epay.png",
      "tech": ["Vue"],
      "url": "https://epay.com.pk/"
    }
  }
}
